In [12]:
import pandas as pd
import numpy as np

In [9]:
data = {'Product': ['Tablet', 'Printer', 'Laptop', 'Monitor', 'Computer'], 
        'Price': [250, 150, 1200, 300, 1500]
        }

df = pd.DataFrame(data, columns= ['Product', 'Price'])

print(df)

    Product  Price
0    Tablet    250
1   Printer    150
2    Laptop   1200
3   Monitor    300
4  Computer   1500

In [13]:
df.index = np.arange(1, len(df)+1)

In [14]:
df

    Product  Price
1    Tablet    250
2   Printer    150
3    Laptop   1200
4   Monitor    300
5  Computer   1500